logs/qwen3-std-bench-3146391.log
START TIME : 2026-08-22T02:25:10+02:00
nodes      : nid[006857,007437] (head nid006857, ray 31391, serve 24391)
model      : Qwen/Qwen3-30B-A3B  TP=1 DP=8 EP=8 via ray (8 GPUs, 4 replicas/node)
bench      : random dataset seed=42, in=4096 out=1, 3000 prompts x 1 passes
output     : /iopsstor/scratch/cscs/mvasilev/vllm-play/qwen3-std-results/bench-prefill4k-ctrl-1ch-3146391
0: 2026-08-22 02:25:19,385	INFO usage_lib.py:448 -- Usage stats collection is disabled.
0: 2026-08-22 02:25:19,386	INFO scripts.py:1042 -- Local node IP: 172.28.35.244
0: 2026-08-22 02:25:22,692	SUCC scripts.py:1081 -- --------------------
0: 2026-08-22 02:25:22,692	SUCC scripts.py:1082 -- Ray runtime started.
0: 2026-08-22 02:25:22,692	SUCC scripts.py:1083 -- --------------------
0: 2026-08-22 02:25:22,692	INFO scripts.py:1085 -- Next steps
0: 2026-08-22 02:25:22,693	INFO cli_output_helpers.py:16 -- Note: The following commands are intended for use on
0: 2026-08-22 02:25:22,693	INFO cli_output_helpers.py:17 -- the head node or within the cluster network.
0: 2026-08-22 02:25:22,693	INFO scripts.py:1089 -- To add another node to this Ray cluster, run
0: 2026-08-22 02:25:22,693	INFO scripts.py:1092 --   ray start --address='172.28.35.244:31391'
0: 2026-08-22 02:25:22,693	INFO scripts.py:1103 -- To connect to this Ray cluster:
0: 2026-08-22 02:25:22,693	INFO scripts.py:1105 -- import ray
0: 2026-08-22 02:25:22,693	INFO scripts.py:1106 -- ray.init()
0: 2026-08-22 02:25:22,693	INFO scripts.py:1139 -- To terminate the Ray runtime, run
0: 2026-08-22 02:25:22,693	INFO scripts.py:1140 --   ray stop
0: 2026-08-22 02:25:22,693	INFO scripts.py:1143 -- To view the status of the cluster, use
0: 2026-08-22 02:25:22,693	INFO scripts.py:1144 --   ray status
0: 
1: 2026-08-22 02:25:24,393	INFO scripts.py:1231 -- Local node IP: 172.28.43.180
1: 2026-08-22 02:25:27,009	SUCC scripts.py:1247 -- --------------------
1: 2026-08-22 02:25:27,009	SUCC scripts.py:1248 -- Ray runtime started.
1: 2026-08-22 02:25:27,009	SUCC scripts.py:1249 -- --------------------
1: 2026-08-22 02:25:27,009	INFO scripts.py:1251 -- To terminate the Ray runtime, run
1: 2026-08-22 02:25:27,009	INFO scripts.py:1252 --   ray stop
1: 
0: ray cluster up: 8 GPUs
0: SERVE HEALTHY after startup (attempt 1)
0: ===== BENCH PASS 1 =====
0: Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x4005b18f1c60>, trust_remote_code=False, seed=42, num_prompts=3000, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=1, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, 
0: random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=24391, endpoint='/v1/completions', header=None, max_concurrency=512, model='Qwen/Qwen3-30B-A3B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/iopsstor
0: /scratch/cscs/mvasilev/vllm-play/qwen3-std-results/bench-prefill4k-ctrl-1ch-3146391', result_filename='bench_pass1.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-5742c136-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
0: INFO 08-22 02:28:16 [utils.py:90] Sampling input_len from [4096, 4096] and output_len from [1, 1]
0: WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
0: Starting initial single prompt test run...
0: Skipping endpoint ready check.
0: Starting main benchmark run...
0: Traffic request rate: inf
0: Burstiness factor: 1.0 (Poisson process)
0: Maximum request concurrency: 512
  0%|          | 0/3000 [00:00<?, ?it/s]
  0%|          | 1/3000 [00:00<29:55,  1.67it/s]
  0%|          | 2/3000 [00:00<18:21,  2.72it/s]
  0%|          | 3/3000 [00:02<45:29,  1.10it/s]
  1%|          | 19/3000 [00:03<06:28,  7.67it/s]
  1%|          | 22/3000 [00:04<10:12,  4.86it/s]
  1%|▏         | 38/3000 [00:06<06:53,  7.16it/s]
  2%|▏         | 54/3000 [00:07<05:49,  8.42it/s]
  2%|▏         | 70/3000 [00:09<05:20,  9.15it/s]
  3%|▎         | 86/3000 [00:10<05:03,  9.60it/s]
  3%|▎         | 102/3000 [00:12<04:52,  9.90it/s]
  4%|▍         | 118/3000 [00:13<04:45, 10.09it/s]
  4%|▍         | 134/3000 [00:15<04:40, 10.22it/s]
  5%|▌         | 150/3000 [00:16<04:35, 10.34it/s]
  6%|▌         | 166/3000 [00:18<04:33, 10.38it/s]
  6%|▌         | 182/3000 [00:19<04:30, 10.41it/s]
  7%|▋         | 198/3000 [00:21<04:28, 10.45it/s]
  7%|▋         | 214/3000 [00:23<04:26, 10.47it/s]
  8%|▊         | 230/3000 [00:24<04:24, 10.49it/s]
  8%|▊         | 246/3000 [00:26<04:22, 10.51it/s]
  9%|▊         | 262/3000 [00:27<04:20, 10.52it/s]
  9%|▉         | 278/3000 [00:29<04:18, 10.52it/s]
 10%|▉         | 294/3000 [00:30<04:17, 10.51it/s]
 10%|█         | 310/3000 [00:32<04:15, 10.51it/s]
 11%|█         | 326/3000 [00:33<04:14, 10.52it/s]
 11%|█▏        | 342/3000 [00:35<04:13, 10.50it/s]
 12%|█▏        | 358/3000 [00:36<04:11, 10.51it/s]
 12%|█▏        | 374/3000 [00:38<04:09, 10.51it/s]
 13%|█▎        | 390/3000 [00:39<04:08, 10.52it/s]
 14%|█▎        | 406/3000 [00:41<04:06, 10.52it/s]
 14%|█▍        | 422/3000 [00:42<04:04, 10.53it/s]
 15%|█▍        | 438/3000 [00:44<04:03, 10.53it/s]
 15%|█▌        | 454/3000 [00:45<04:01, 10.52it/s]
 16%|█▌        | 470/3000 [00:47<04:00, 10.52it/s]
 16%|█▌        | 486/3000 [00:48<03:57, 10.57it/s]
 17%|█▋        | 502/3000 [00:50<03:57, 10.50it/s]
 17%|█▋        | 518/3000 [00:51<03:56, 10.51it/s]
 18%|█▊        | 534/3000 [00:53<03:54, 10.51it/s]
 18%|█▊        | 550/3000 [00:54<03:53, 10.50it/s]
 19%|█▉        | 566/3000 [00:56<03:51, 10.51it/s]
 19%|█▉        | 582/3000 [00:58<03:49, 10.51it/s]
 20%|█▉        | 598/3000 [00:59<03:48, 10.52it/s]
 20%|██        | 614/3000 [01:01<03:46, 10.52it/s]
 21%|██        | 630/3000 [01:02<03:45, 10.51it/s]
 22%|██▏       | 646/3000 [01:04<03:43, 10.53it/s]
 22%|██▏       | 662/3000 [01:05<03:42, 10.51it/s]
 23%|██▎       | 678/3000 [01:07<03:40, 10.53it/s]
 23%|██▎       | 694/3000 [01:08<03:39, 10.51it/s]
 24%|██▎       | 710/3000 [01:10<03:37, 10.53it/s]
 24%|██▍       | 726/3000 [01:11<03:36, 10.52it/s]
 25%|██▍       | 742/3000 [01:13<03:34, 10.52it/s]
 25%|██▌       | 758/3000 [01:14<03:33, 10.52it/s]
 26%|██▌       | 774/3000 [01:16<03:30, 10.55it/s]
 26%|██▋       | 790/3000 [01:17<03:30, 10.52it/s]
 27%|██▋       | 806/3000 [01:19<03:28, 10.52it/s]
 27%|██▋       | 822/3000 [01:20<03:26, 10.53it/s]
 28%|██▊       | 838/3000 [01:22<03:25, 10.53it/s]
 28%|██▊       | 854/3000 [01:23<03:23, 10.56it/s]
 29%|██▉       | 870/3000 [01:25<03:22, 10.50it/s]
 30%|██▉       | 886/3000 [01:26<03:21, 10.52it/s]
 30%|███       | 902/3000 [01:28<03:19, 10.51it/s]
 31%|███       | 918/3000 [01:29<03:18, 10.50it/s]
 31%|███       | 934/3000 [01:31<03:16, 10.53it/s]
 32%|███▏      | 950/3000 [01:33<03:15, 10.51it/s]
 32%|███▏      | 966/3000 [01:34<03:13, 10.50it/s]
 33%|███▎      | 982/3000 [01:36<03:12, 10.50it/s]
 33%|███▎      | 998/3000 [01:37<03:10, 10.50it/s]
 34%|███▍      | 1014/3000 [01:39<03:08, 10.53it/s]
 34%|███▍      | 1030/3000 [01:40<03:07, 10.52it/s]
 35%|███▍      | 1046/3000 [01:42<03:06, 10.49it/s]
 35%|███▌      | 1062/3000 [01:43<03:04, 10.50it/s]
 36%|███▌      | 1078/3000 [01:45<03:03, 10.48it/s]
 36%|███▋      | 1094/3000 [01:46<03:01, 10.49it/s]
 37%|███▋      | 1110/3000 [01:48<02:59, 10.53it/s]
 38%|███▊      | 1126/3000 [01:49<02:58, 10.51it/s]
 38%|███▊      | 1142/3000 [01:51<02:58, 10.44it/s]
 39%|███▊      | 1158/3000 [01:52<02:55, 10.51it/s]
 39%|███▉      | 1174/3000 [01:54<02:53, 10.51it/s]
 40%|███▉      | 1190/3000 [01:55<02:51, 10.53it/s]
 40%|████      | 1206/3000 [01:57<02:50, 10.53it/s]
 41%|████      | 1222/3000 [01:58<02:48, 10.54it/s]
 41%|████▏     | 1238/3000 [02:00<02:47, 10.52it/s]
 42%|████▏     | 1254/3000 [02:01<02:45, 10.52it/s]
 42%|████▏     | 1270/3000 [02:03<02:44, 10.52it/s]
 43%|████▎     | 1286/3000 [02:04<02:42, 10.52it/s]
 43%|████▎     | 1302/3000 [02:06<02:41, 10.52it/s]
 44%|████▍     | 1318/3000 [02:07<02:39, 10.57it/s]
 44%|████▍     | 1334/3000 [02:09<02:38, 10.51it/s]
 45%|████▌     | 1350/3000 [02:11<02:36, 10.52it/s]
 46%|████▌     | 1366/3000 [02:12<02:35, 10.52it/s]
 46%|████▌     | 1382/3000 [02:14<02:33, 10.52it/s]
 47%|████▋     | 1398/3000 [02:15<02:32, 10.51it/s]
 47%|████▋     | 1414/3000 [02:17<02:30, 10.52it/s]
 48%|████▊     | 1430/3000 [02:18<02:29, 10.51it/s]
 48%|████▊     | 1446/3000 [02:20<02:27, 10.53it/s]
 49%|████▊     | 1462/3000 [02:21<02:26, 10.53it/s]
 49%|████▉     | 1478/3000 [02:23<02:24, 10.56it/s]
 50%|████▉     | 1494/3000 [02:24<02:23, 10.53it/s]
 50%|█████     | 1510/3000 [02:26<02:22, 10.48it/s]
 51%|█████     | 1526/3000 [02:27<02:20, 10.50it/s]
 51%|█████▏    | 1542/3000 [02:29<02:18, 10.52it/s]
 52%|█████▏    | 1558/3000 [02:30<02:17, 10.51it/s]
 52%|█████▏    | 1574/3000 [02:32<02:15, 10.51it/s]
 53%|█████▎    | 1590/3000 [02:33<02:13, 10.53it/s]
 54%|█████▎    | 1606/3000 [02:35<02:12, 10.52it/s]
 54%|█████▍    | 1622/3000 [02:36<02:11, 10.52it/s]
 55%|█████▍    | 1638/3000 [02:38<02:09, 10.49it/s]
 55%|█████▌    | 1654/3000 [02:39<02:08, 10.52it/s]
 56%|█████▌    | 1670/3000 [02:41<02:06, 10.52it/s]
 56%|█████▌    | 1686/3000 [02:42<02:04, 10.53it/s]
 57%|█████▋    | 1702/3000 [02:44<02:03, 10.53it/s]
 57%|█████▋    | 1718/3000 [02:46<02:01, 10.53it/s]
 58%|█████▊    | 1734/3000 [02:47<02:00, 10.54it/s]
 58%|█████▊    | 1750/3000 [02:49<01:58, 10.53it/s]
 59%|█████▉    | 1766/3000 [02:50<01:57, 10.52it/s]
 59%|█████▉    | 1782/3000 [02:52<01:55, 10.52it/s]
 60%|█████▉    | 1798/3000 [02:53<01:54, 10.52it/s]
 60%|██████    | 1814/3000 [02:55<01:52, 10.52it/s]
 61%|██████    | 1830/3000 [02:56<01:51, 10.51it/s]
 62%|██████▏   | 1846/3000 [02:58<01:49, 10.51it/s]
 62%|██████▏   | 1862/3000 [02:59<01:48, 10.52it/s]
 63%|██████▎   | 1878/3000 [03:01<01:46, 10.53it/s]
 63%|██████▎   | 1894/3000 [03:02<01:45, 10.51it/s]
 64%|██████▎   | 1910/3000 [03:04<01:43, 10.51it/s]
 64%|██████▍   | 1926/3000 [03:05<01:42, 10.51it/s]
 65%|██████▍   | 1942/3000 [03:07<01:40, 10.51it/s]
 65%|██████▌   | 1958/3000 [03:08<01:39, 10.51it/s]
 66%|██████▌   | 1974/3000 [03:10<01:37, 10.53it/s]
 66%|██████▋   | 1990/3000 [03:11<01:36, 10.52it/s]
 67%|██████▋   | 2006/3000 [03:13<01:34, 10.52it/s]
 67%|██████▋   | 2022/3000 [03:14<01:32, 10.52it/s]
 68%|██████▊   | 2038/3000 [03:16<01:31, 10.53it/s]
 68%|██████▊   | 2054/3000 [03:17<01:29, 10.53it/s]
 69%|██████▉   | 2070/3000 [03:19<01:28, 10.52it/s]
 70%|██████▉   | 2086/3000 [03:21<01:26, 10.52it/s]
 70%|███████   | 2102/3000 [03:22<01:25, 10.53it/s]
 71%|███████   | 2118/3000 [03:24<01:23, 10.52it/s]
 71%|███████   | 2134/3000 [03:25<01:22, 10.53it/s]
 72%|███████▏  | 2150/3000 [03:27<01:20, 10.53it/s]
 72%|███████▏  | 2166/3000 [03:28<01:19, 10.55it/s]
 73%|███████▎  | 2182/3000 [03:30<01:17, 10.52it/s]
 73%|███████▎  | 2198/3000 [03:31<01:16, 10.53it/s]
 74%|███████▍  | 2214/3000 [03:33<01:14, 10.51it/s]
 74%|███████▍  | 2230/3000 [03:34<01:13, 10.51it/s]
 75%|███████▍  | 2246/3000 [03:36<01:11, 10.53it/s]
 75%|███████▌  | 2262/3000 [03:37<01:10, 10.53it/s]
 76%|███████▌  | 2278/3000 [03:39<01:08, 10.52it/s]
 76%|███████▋  | 2294/3000 [03:40<01:07, 10.51it/s]
 77%|███████▋  | 2310/3000 [03:42<01:05, 10.52it/s]
 78%|███████▊  | 2326/3000 [03:43<01:04, 10.53it/s]
 78%|███████▊  | 2342/3000 [03:45<01:02, 10.48it/s]
 79%|███████▊  | 2358/3000 [03:46<01:01, 10.52it/s]
 79%|███████▉  | 2374/3000 [03:48<00:59, 10.51it/s]
 80%|███████▉  | 2390/3000 [03:49<00:58, 10.51it/s]
 80%|████████  | 2406/3000 [03:51<00:56, 10.51it/s]
 81%|████████  | 2422/3000 [03:52<00:55, 10.51it/s]
 81%|████████▏ | 2438/3000 [03:54<00:53, 10.53it/s]
 82%|████████▏ | 2454/3000 [03:56<00:51, 10.50it/s]
 82%|████████▏ | 2470/3000 [03:57<00:50, 10.51it/s]
 83%|████████▎ | 2486/3000 [03:59<00:48, 10.54it/s]
 83%|████████▎ | 2502/3000 [04:00<00:47, 10.52it/s]
 84%|████████▍ | 2518/3000 [04:02<00:45, 10.51it/s]
 84%|████████▍ | 2534/3000 [04:03<00:44, 10.54it/s]
 85%|████████▌ | 2550/3000 [04:05<00:42, 10.50it/s]
 86%|████████▌ | 2566/3000 [04:06<00:41, 10.51it/s]
 86%|████████▌ | 2582/3000 [04:08<00:39, 10.50it/s]
 87%|████████▋ | 2598/3000 [04:09<00:38, 10.52it/s]
 87%|████████▋ | 2614/3000 [04:11<00:36, 10.52it/s]
 88%|████████▊ | 2630/3000 [04:12<00:35, 10.51it/s]
 88%|████████▊ | 2646/3000 [04:14<00:33, 10.52it/s]
 89%|████████▊ | 2662/3000 [04:15<00:32, 10.52it/s]
 89%|████████▉ | 2678/3000 [04:17<00:30, 10.52it/s]
 90%|████████▉ | 2694/3000 [04:18<00:29, 10.51it/s]
 90%|█████████ | 2710/3000 [04:20<00:27, 10.52it/s]
 91%|█████████ | 2726/3000 [04:21<00:26, 10.52it/s]
 91%|█████████▏| 2742/3000 [04:23<00:24, 10.52it/s]
 92%|█████████▏| 2758/3000 [04:24<00:23, 10.52it/s]
 92%|█████████▏| 2774/3000 [04:26<00:21, 10.51it/s]
 93%|█████████▎| 2790/3000 [04:27<00:19, 10.53it/s]
 94%|█████████▎| 2806/3000 [04:29<00:18, 10.53it/s]
 94%|█████████▍| 2822/3000 [04:30<00:16, 10.53it/s]
 95%|█████████▍| 2838/3000 [04:32<00:15, 10.52it/s]
 95%|█████████▌| 2854/3000 [04:34<00:13, 10.52it/s]
 96%|█████████▌| 2870/3000 [04:35<00:12, 10.52it/s]
 96%|█████████▌| 2886/3000 [04:37<00:10, 10.52it/s]
 97%|█████████▋| 2902/3000 [04:38<00:09, 10.53it/s]
 97%|█████████▋| 2918/3000 [04:40<00:07, 10.52it/s]
 98%|█████████▊| 2934/3000 [04:41<00:06, 10.53it/s]
 98%|█████████▊| 2950/3000 [04:43<00:04, 10.56it/s]
 99%|█████████▉| 2966/3000 [04:44<00:03, 10.52it/s]
 99%|█████████▉| 2982/3000 [04:46<00:01, 10.05it/s]
100%|█████████▉| 2998/3000 [04:47<00:00, 12.18it/s]
100%|██████████| 3000/3000 [04:47<00:00, 10.45it/s]
0: tip: install termplotlib and gnuplot to plot the metrics
0: ============ Serving Benchmark Result ============
0: Successful requests:                     3000      
0: Failed requests:                         0         
0: Maximum request concurrency:             512       
0: Benchmark duration (s):                  287.10    
0: Total input tokens:                      12288000  
0: Total generated tokens:                  3000      
0: Request throughput (req/s):              10.45     
0: Output token throughput (tok/s):         10.45     
0: Peak output token throughput (tok/s):    16.00     
0: Peak concurrent requests:                528.00    
0: Total token throughput (tok/s):          42811.08  
0: ---------------Time to First Token----------------
0: Mean TTFT (ms):                          44862.09  
0: Median TTFT (ms):                        48671.47  
0: P99 TTFT (ms):                           48932.46  
0: ----------------End-to-end Latency----------------
0: Mean E2EL (ms):                          44862.09  
0: Median E2EL (ms):                        48671.47  
0: P99 E2EL (ms):                           48932.46  
0: ==================================================
0: BENCH_PASS_1_WALL_SECONDS 362
0: 2026-08-22 02:34:08,762	VINFO scripts.py:1418 -- Send termination request to `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/core/src/ray/raylet/raylet --raylet_socket_name=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/sockets/raylet --store_socket_name=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/sockets/plasma_store --object_manager_port=0 --min_worker_port=10002 --max_worker_port=19999 --node_manager_port=0 --node_id=2ea5035511a28ecfbe8f6d79584011c86ed27b86a9fe2fcce9859bd1 --node_ip_address=172.28.35.244 --maximum_startup_concurrency=288 --static_resource_list=node:172.28.35.244,1.0,node:__internal_head__,1.0,accelerator_type:GH200,1,CPU,288,GPU,4,memory,335741550592,object_store_memory,143889235968 "--python_worker_command=/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/workers/setup_worker.py -s /iopsstor/scratch/cscs/mvasilev/v
0: llm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/workers/default_worker.py --node-ip-address=172.28.35.244 --node-manager-port=RAY_NODE_MANAGER_PORT_PLACEHOLDER --object-store-name=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/sockets/plasma_store --raylet-name=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/sockets/raylet --redis-address=None --metrics-agent-port=0 --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --runtime-env-agent-port=0 --gcs-address=172.28.35.244:31391 --session-name=session_2026-08-22_02-25-19_387208_86261 --temp-dir=/tmp/ray --webui= --cluster-id=3927e10a732cc8e9ad5f8879d71c179e57e92d56a40d729878e229f9 RAY_WORKER_DYNAMIC_OPTION_PLACEHOLDER" --java_worker_command= --cpp_worker_command= --native_library_path=/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/cpp/lib --temp_dir=/tmp/ray --session_dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261 --log_dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/l
0: ogs --resource_dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/runtime_resources --metrics-agent-port=0 --metrics_export_port=0 --runtime_env_agent_port=0 --object_store_memory=143889235968 --plasma_directory=/dev/shm --fallback_directory=/tmp/ray/session_2026-08-22_02-25-19_387208_86261 --ray-debugger-external=0 --gcs-address=172.28.35.244:31391 --session-name=session_2026-08-22_02-25-19_387208_86261 "--labels={\"ray.io/accelerator-type\": \"GH200\"}" --cluster-id=3927e10a732cc8e9ad5f8879d71c179e57e92d56a40d729878e229f9 --stdout_filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/raylet.out --stderr_filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/raylet.err --head --num_prestart_python_workers=288 "--dashboard_agent_command=/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/dashboard/agent.py --node-id=2ea5035511a28ecfbe8f6d79584011c86ed27b86a9fe2fcce9859bd1 --nod
0: e-ip-address=172.28.35.244 --metrics-export-port=0 --grpc-port=0 --listen-port=52365 --node-manager-port=RAY_NODE_MANAGER_PORT_PLACEHOLDER --object-store-name=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/sockets/plasma_store --raylet-name=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/sockets/raylet --temp-dir=/tmp/ray --session-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261 --log-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --session-name=session_2026-08-22_02-25-19_387208_86261 --gcs-address=172.28.35.244:31391 --cluster-id-hex=3927e10a732cc8e9ad5f8879d71c179e57e92d56a40d729878e229f9 --stdout-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/dashboard_agent.out --stderr-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/dashboard_agent.err --logging-filename=dashboard_agent.log --head" "--runtime_env_agent_command=/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /
0: iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/runtime_env/agent/main.py --node-id=2ea5035511a28ecfbe8f6d79584011c86ed27b86a9fe2fcce9859bd1 --node-ip-address=172.28.35.244 --runtime-env-agent-port=0 --session-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261 --gcs-address=172.28.35.244:31391 --cluster-id-hex=3927e10a732cc8e9ad5f8879d71c179e57e92d56a40d729878e229f9 --runtime-env-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/runtime_resources --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --log-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs --temp-dir=/tmp/ray --stdout-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/runtime_env_agent.out --stderr-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/runtime_env_agent.err --logging-filename=runtime_env_agent.log"` (via SIGTERM)
0: 2026-08-22 02:34:08,984	INFO scripts.py:1448 -- 1/1 stopped.
0: 2026-08-22 02:34:09,293	VINFO scripts.py:1418 -- Send termination request to `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/autoscaler/_private/monitor.py --logs-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --gcs-address=172.28.35.244:31391 --stdout-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/monitor.out --stderr-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/monitor.err --monitor-ip=172.28.35.244` (via SIGTERM)
0: 2026-08-22 02:34:09,293	VINFO scripts.py:1418 -- Send termination request to `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/log_monitor.py --session-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261 --logs-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs --gcs-address=172.28.35.244:31391 --node-ip-address=172.28.35.244 --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --stdout-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/log_monitor.out --stderr-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/log_monitor.err` (via SIGTERM)
0: 2026-08-22 02:34:09,294	VINFO scripts.py:1418 -- Send termination request to `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -m ray.util.client.server --address=172.28.35.244:31391 --host=172.28.35.244 --port=10001 --mode=proxy --runtime-env-agent-address=http://172.28.35.244:0 --node-id=2ea5035511a28ecfbe8f6d79584011c86ed27b86a9fe2fcce9859bd1` (via SIGTERM)
0: 2026-08-22 02:34:09,300	VINFO scripts.py:1426 -- Attempted to stop `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/log_monitor.py --session-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261 --logs-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs --gcs-address=172.28.35.244:31391 --node-ip-address=172.28.35.244 --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --stdout-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/log_monitor.out --stderr-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/log_monitor.err`, but process was already dead.
0: 2026-08-22 02:34:09,302	VINFO scripts.py:1418 -- Send termination request to `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/dashboard/dashboard.py --host=127.0.0.1 --port=8265 --port-retries=0 --temp-dir=/tmp/ray --log-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs --session-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261 --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --gcs-address=172.28.35.244:31391 --cluster-id-hex=3927e10a732cc8e9ad5f8879d71c179e57e92d56a40d729878e229f9 --node-ip-address=172.28.35.244 --proxy-server-url= --stdout-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/dashboard.out --stderr-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/dashboard.err --modules-to-load=UsageStatsHead --disable-frontend` (via SIGTERM)
2026-08-22 02:34:09,555	INFO scripts.py:1448 -- 2/4 stopped.
0: 2026-08-22 02:34:09,555	INFO scripts.py:1448 -- 3/4 stopped.
0: 2026-08-22 02:34:09,872	INFO scripts.py:1448 -- 4/4 stopped.
1: 2026-08-22 02:34:09,982	VINFO scripts.py:1418 -- Send termination request to `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/core/src/ray/raylet/raylet --raylet_socket_name=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/sockets/raylet --store_socket_name=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/sockets/plasma_store --object_manager_port=0 --min_worker_port=10002 --max_worker_port=19999 --node_manager_port=0 --node_id=ccab0372f82d4a34e18d3e5bd8c5457c454c327e5633e49bd8aa4ced --node_ip_address=172.28.43.180 --maximum_startup_concurrency=288 --static_resource_list=node:172.28.43.180,1.0,accelerator_type:GH200,1,CPU,288,GPU,4,memory,337294196736,object_store_memory,144554655744 "--python_worker_command=/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/workers/setup_worker.py -s /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/li
1: b/python3.12/site-packages/ray/_private/workers/default_worker.py --node-ip-address=172.28.43.180 --node-manager-port=RAY_NODE_MANAGER_PORT_PLACEHOLDER --object-store-name=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/sockets/plasma_store --raylet-name=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/sockets/raylet --redis-address=None --metrics-agent-port=0 --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --runtime-env-agent-port=0 --gcs-address=nid006857:31391 --session-name=session_2026-08-22_02-25-19_387208_86261 --temp-dir=/tmp/ray --webui= --cluster-id=3927e10a732cc8e9ad5f8879d71c179e57e92d56a40d729878e229f9 RAY_WORKER_DYNAMIC_OPTION_PLACEHOLDER" --java_worker_command= --cpp_worker_command= --native_library_path=/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/cpp/lib --temp_dir=/tmp/ray --session_dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261 --log_dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs --resource_dir=/tmp/ray/ses
1: sion_2026-08-22_02-25-19_387208_86261/runtime_resources --metrics-agent-port=0 --metrics_export_port=0 --runtime_env_agent_port=0 --object_store_memory=144554655744 --plasma_directory=/dev/shm --fallback_directory=/tmp/ray/session_2026-08-22_02-25-19_387208_86261 --ray-debugger-external=0 --gcs-address=nid006857:31391 --session-name=session_2026-08-22_02-25-19_387208_86261 "--labels={\"ray.io/accelerator-type\": \"GH200\"}" --cluster-id=3927e10a732cc8e9ad5f8879d71c179e57e92d56a40d729878e229f9 --stdout_filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/raylet.out --stderr_filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/raylet.err --num_prestart_python_workers=288 "--dashboard_agent_command=/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/dashboard/agent.py --node-id=ccab0372f82d4a34e18d3e5bd8c5457c454c327e5633e49bd8aa4ced --node-ip-address=172.28.43.180 --metrics-expor
1: t-port=0 --grpc-port=0 --listen-port=52365 --node-manager-port=RAY_NODE_MANAGER_PORT_PLACEHOLDER --object-store-name=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/sockets/plasma_store --raylet-name=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/sockets/raylet --temp-dir=/tmp/ray --session-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261 --log-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --session-name=session_2026-08-22_02-25-19_387208_86261 --gcs-address=nid006857:31391 --cluster-id-hex=3927e10a732cc8e9ad5f8879d71c179e57e92d56a40d729878e229f9 --stdout-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/dashboard_agent.out --stderr-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/dashboard_agent.err --logging-filename=dashboard_agent.log" "--runtime_env_agent_command=/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-ve
1: nv/lib/python3.12/site-packages/ray/_private/runtime_env/agent/main.py --node-id=ccab0372f82d4a34e18d3e5bd8c5457c454c327e5633e49bd8aa4ced --node-ip-address=172.28.43.180 --runtime-env-agent-port=0 --session-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261 --gcs-address=nid006857:31391 --cluster-id-hex=3927e10a732cc8e9ad5f8879d71c179e57e92d56a40d729878e229f9 --runtime-env-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/runtime_resources --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --log-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs --temp-dir=/tmp/ray --stdout-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/runtime_env_agent.out --stderr-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/runtime_env_agent.err --logging-filename=runtime_env_agent.log"` (via SIGTERM)
1: 2026-08-22 02:34:09,999	INFO scripts.py:1448 -- 1/1 stopped.
0: 2026-08-22 02:34:10,167	VINFO scripts.py:1418 -- Send termination request to `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/core/src/ray/gcs/gcs_server --log_dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs --config_list=eyJhdXRvbWF0aWNfb2JqZWN0X3NwaWxsaW5nX2VuYWJsZWQiOiB0cnVlLCAib2JqZWN0X3NwaWxsaW5nX2NvbmZpZyI6ICJ7XCJ0eXBlXCI6IFwiZmlsZXN5c3RlbVwiLCBcInBhcmFtc1wiOiB7XCJkaXJlY3RvcnlfcGF0aFwiOiBcIi90bXAvcmF5L3Nlc3Npb25fMjAyNi0wOC0yMl8wMi0yNS0xOV8zODcyMDhfODYyNjFcIn19IiwgImlzX2V4dGVybmFsX3N0b3JhZ2VfdHlwZV9mcyI6IHRydWV9 --gcs_server_port=31391 --metrics-agent-port=0 --node-ip-address=172.28.35.244 --session-name=session_2026-08-22_02-25-19_387208_86261 --ray-commit=4464bbb6e21bce4893ed3396b2e33996188d511d --session-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261 --node-id=2ea5035511a28ecfbe8f6d79584011c86ed27b86a9fe2fcce9859bd1 --stdout_filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/gcs_server.out --stderr_filepath=/tmp/ray/session_
0: 2026-08-22_02-25-19_387208_86261/logs/gcs_server.err` (via SIGTERM)
1: 2026-08-22 02:34:10,359	VINFO scripts.py:1418 -- Send termination request to `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/log_monitor.py --session-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261 --logs-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs --gcs-address=nid006857:31391 --node-ip-address=172.28.43.180 --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --stdout-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/log_monitor.out --stderr-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/log_monitor.err` (via SIGTERM)
1: 2026-08-22 02:34:10,365	VINFO scripts.py:1426 -- Attempted to stop `/iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/bin/python3 -u /iopsstor/scratch/cscs/mvasilev/vllm-play/lmeval-std-venv/lib/python3.12/site-packages/ray/_private/log_monitor.py --session-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261 --logs-dir=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs --gcs-address=nid006857:31391 --node-ip-address=172.28.43.180 --logging-rotate-bytes=536870912 --logging-rotate-backup-count=5 --stdout-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/log_monitor.out --stderr-filepath=/tmp/ray/session_2026-08-22_02-25-19_387208_86261/logs/log_monitor.err`, but process was already dead.
1: 2026-08-22 02:34:10,369	INFO scripts.py:1448 -- 1/1 stopped.
0: 2026-08-22 02:34:10,545	INFO scripts.py:1448 -- 1/1 stopped.
0: 2026-08-22 02:34:10,545	SUCC scripts.py:1493 -- Stopped all 6 Ray processes.
0: 
1: 2026-08-22 02:34:10,735	SUCC scripts.py:1493 -- Stopped all 2 Ray processes.
1: 
END TIME   : 2026-08-22T02:34:11+02:00  rc=0